package com.cooler.ai.platform.client.testcase;

import java.util.*;

/**
 * Created by zhangsheng on 2018/7/17.
 */
public class Waimai {

    static String[] querys1 = {
            "我要点外卖",
            "按单价降序排列",
            "哈哈",
            "哈哈",
            "第二个",
            "哈哈",
            "按单价升序排列",
            "第三个",
            "第二个",
            ""
    };
    static String[] querys2 = {
            "我要吃套餐2",
            "换一批",
            "换一批",
            "换一批",
            "按单价降序排列",
            ""
    };
    static String[] querys3 = {
            "看一看肯德基",
            "第一个",
            "第二个",
            "查看购物车",
            "清空购物车",
            "查看购物车",
            "去下单",
            "继续购物",
            "第一个",
            "去下单",
            "第二个",
            "去下单",
            ""
    };

    static String[] querys4 = {
            "看一看肯德基",
            "第二个",
            "清空购物车",
            "继续购物",
//                    "第一个",
            "哈哈",
            "哈哈",
//                    "哈哈",
//                    "哈哈",
            "第二个",
//                    "哈哈",
            "第一个",
//                    "第二个",
//                    "查看购物车",
            "去下单",
            ""
    };

    static String[] querys5 = {
            "看一看肯德基",
            "第一个",
            "清空购物车",
//                    "我要点外卖",
            "我要吃套餐2",                        //从这里开始跳出前面的上下文
            "按单价降序排列",
            "哈哈",
            "帮助",
            "哈哈",
            "第一个",
            "第一个",
            "查看购物车",
            "我要点外卖",
//                    "去下单",
            "看一看麦当劳",
            "第二个",
            "第一个",
            "第二个",
            "去下单",
            "支付",
            ""
    };

    static String[] querys6 = {
//                    "去下单",                            //todo：1.如果"去下单"作为对话第一轮，则是在没有选定领域的情况下发指令，（order_deal没有指明domainName），会报错，但这个一时半刻解决不了，现在bot都是游离的，对话最初时还应该要有一个领域判断过程，来确定领域。
            "我要吃套餐2",
            "第二个",
            "帮助",
            "帮助",
            "帮助",
            "第一个",
            "查看购物车",
            "去下单",
            "帮助",
            "帮助",
            "帮助",
            "帮助",
            "支付",
            ""
    };
    static String[] querys7 = {
            "再来一单",                     //第0页
            "下一页",                      //第1页
            "第二个",
            "重新开始",
            "查看购物车",
            "去下单",
            ""
    };
    static String[] querys8 = {
            "再来一单",                     //第0页
            "下一页",                      //第1页
            "第二个",
            "支付",
            ""
    };

    public static Map<String, String[]> querysGroup = new HashMap<String, String[]>() {{
        put("点外卖", querys1);
        put("直接搜索", querys2);                                               //todo：这个有待优化，里面说了排序之后应该从头开始查询，页码回复到第一页
        put("操作购物车", querys3);
        put("去下单", querys4);
        put("跳出上下文", querys5);                                                                      //跳出上下文还是不支持啊，
        put("支付", querys6);
//        put("再来一单", querys7);                           //todo：重新开始，很可能触发，还没有处理好
//        put("选订单支付", querys8);
    }};

}
